#include <stdio.h>

/*
 * Задание повышенной сложности.
 * Составить алгоритм, определяющий является ли число простым.
 * Реализовать алгоритм в виде программы на языке C++.
 * Формат вводимых данных: одно целое число.
 * Формат выводимых данных: слово «Да» или «Нет».
 * 
 */

int main(int argc, char **argv)
{
	printf("hello world\n");
	return 0;
}
